[
  {
    "id": 1,
    "text": "It's a busy Friday evening, and there's a power outage in the neighborhood, leaving half the kitchen appliances without power. The kitchen is already working at full capacity, and now orders are getting delayed. Front-of-house staff are getting anxious as customers keep asking for updates. The temperature in the kitchen is rising, and you can sense stress levels increasing among your team members. With limited equipment and a full restaurant, what would be your course of action to handle this situation?",
    "orderNumber": 1,
    "category": "Resilience and Adaptability",
    "options": [
      {
        "id": "A",
        "text": "Step away briefly to see if you can expedite restoration of power and trust the team to manage things until you return."
      },
      {
        "id": "B",
        "text": "Delegate to the most experienced cook to determine the new priorities and best use of limited equipment while you ensure the rest of the staff stays focused."
      },
      {
        "id": "C",
        "text": "Take the time to briefly gather the team, explain the situation, and brainstorm solutions with them, allowing everyone to contribute ideas and make decisions as a team."
      },
      {
        "id": "D",
        "text": "Prioritize cold dishes that don't require power, clearly assign each cook a role in preparing those dishes, and personally handle communication with the front-of-house staff to keep them informed."
      },
      {
        "id": "E",
        "text": "Focus on keeping customers happy by managing front-of-house communications while instructing your team to improvise and figure out how to manage without key appliances."
      },
      {
        "id": "F",
        "text": "Additional option F for question 1 - This option provides an alternative perspective on the situation."
      },
      {
        "id": "G",
        "text": "Additional option G for question 1 - This option represents a collaborative approach to problem-solving."
      },
      {
        "id": "H",
        "text": "Additional option H for question 1 - This option focuses on long-term strategic thinking and planning."
      }
    ]
  },
  {
    "id": 2,
    "text": "You notice that during the past week, two of your line cooks have been frequently arguing about the timing of dishes, which is affecting kitchen performance. It's starting to impact other team members, causing delays and increasing stress levels. What do you do to handle this?",
    "orderNumber": 2,
    "category": "Team Dynamics & Collaboration",
    "options": [
      {
        "id": "A",
        "text": "Assign the two cooks to different stations for a few days to minimize direct interaction while the kitchen is busy, and revisit the issue later."
      },
      {
        "id": "B",
        "text": "Call a brief meeting with the entire team to discuss expectations regarding collaboration, emphasizing the importance of working together and asking each member for suggestions on how to improve."
      },
      {
        "id": "C",
        "text": "Have a direct, one-on-one conversation with the more experienced cook, asking them to adjust their approach and manage the issue without further conflict."
      },
      {
        "id": "D",
        "text": "Ignore the situation for now, trusting that the two cooks will eventually work things out on their own without any intervention."
      },
      {
        "id": "E",
        "text": "Take both line cooks aside individually to understand their perspectives and mediate a solution that works for both, ensuring you also check in with them later to see how it's going."
      },
      {
        "id": "F",
        "text": "Additional option F for question 2 - This option provides an alternative perspective on the situation."
      },
      {
        "id": "G",
        "text": "Additional option G for question 2 - This option represents a collaborative approach to problem-solving."
      },
      {
        "id": "H",
        "text": "Additional option H for question 2 - This option focuses on long-term strategic thinking and planning."
      }
    ]
  },
  {
    "id": 3,
    "text": "A key supplier just informed you that an essential ingredient for tonight's special dish will not arrive on time due to a delivery issue. The front-of-house staff has already promoted this dish to customers. What do you do?",
    "orderNumber": 3,
    "category": "Decision-Making & Problem-Solving",
    "options": [
      {
        "id": "A",
        "text": "Quickly contact a different supplier to see if the ingredient can be sourced locally, and let the team know to prepare for a last-minute substitution."
      },
      {
        "id": "B",
        "text": "Immediately inform the front-of-house staff to stop promoting the dish and suggest an alternative special that can be prepared with available ingredients."
      },
      {
        "id": "C",
        "text": "Consult with the head chef about removing the dish from tonight's menu and consider offering customers a small discount or complimentary item as compensation."
      },
      {
        "id": "D",
        "text": "Keep the news to yourself, hoping that the ingredient will arrive in time, and continue preparing the other dishes for now."
      },
      {
        "id": "E",
        "text": "Decide to go ahead without the ingredient, improvising with what's available, and instruct the kitchen to make do with whatever they have."
      },
      {
        "id": "F",
        "text": "Additional option F for question 3 - This option provides an alternative perspective on the situation."
      },
      {
        "id": "G",
        "text": "Additional option G for question 3 - This option represents a collaborative approach to problem-solving."
      },
      {
        "id": "H",
        "text": "Additional option H for question 3 - This option focuses on long-term strategic thinking and planning."
      }
    ]
  },
  {
    "id": 4,
    "text": "One of your team members, who usually performs well, has been making a series of small mistakes over the past few days. They appear distracted, and their behavior is affecting the overall performance of the team. What is your approach to address this?",
    "orderNumber": 4,
    "category": "Self-Awareness & Emotional Intelligence",
    "options": [
      {
        "id": "A",
        "text": "Take them aside during a break and directly instruct them to get their focus back, making it clear that continued mistakes could lead to consequences."
      },
      {
        "id": "B",
        "text": "Give them some space for now, assuming they'll resolve whatever's bothering them on their own."
      },
      {
        "id": "C",
        "text": "Wait until the shift ends, then address the mistakes in front of the team, emphasizing that such errors cannot continue."
      },
      {
        "id": "D",
        "text": "Privately ask the team member if everything is okay and offer your support, while also reminding them of the importance of staying focused during shifts."
      },
      {
        "id": "E",
        "text": "Assign them simpler tasks for the rest of the shift without explaining why, and monitor their performance closely."
      },
      {
        "id": "F",
        "text": "Additional option F for question 4 - This option provides an alternative perspective on the situation."
      },
      {
        "id": "G",
        "text": "Additional option G for question 4 - This option represents a collaborative approach to problem-solving."
      },
      {
        "id": "H",
        "text": "Additional option H for question 4 - This option focuses on long-term strategic thinking and planning."
      }
    ]
  },
  {
    "id": 5,
    "text": "During a busy team meeting, one of the line chefs expresses their frustration about the outdated ordering system, stating that it's causing repeated mistakes in the kitchen. You agree that the system has its flaws, but updating it would be a lengthy and costly process that requires organizational buy-in. Other team members seem to support the line chef's point, and there's a risk that their frustration could spread. How do you respond?",
    "orderNumber": 5,
    "category": "Communication & Active Listening",
    "options": [
      {
        "id": "A",
        "text": "Ignore the comment during the meeting but make a note to follow up privately later, where you can acknowledge the frustration without causing more discussion during a busy time."
      },
      {
        "id": "B",
        "text": "Acknowledge the concerns and explain that, although a complete system upgrade isn't feasible at the moment, you're open to suggestions on ways to work around the system's limitations in the meantime."
      },
      {
        "id": "C",
        "text": "Thank the chef for bringing up the issue, but remind the entire team that they need to do their best with what they have and try to make fewer mistakes."
      },
      {
        "id": "D",
        "text": "Explain that a system upgrade is not a priority for the kitchen right now and that the team should focus on more immediate operational issues rather than lingering on things that can't change."
      },
      {
        "id": "E",
        "text": "Invite the line chef to share their specific concerns in more detail after the meeting and see if there are small process adjustments that could alleviate some of the issues."
      },
      {
        "id": "F",
        "text": "Additional option F for question 5 - This option provides an alternative perspective on the situation."
      },
      {
        "id": "G",
        "text": "Additional option G for question 5 - This option represents a collaborative approach to problem-solving."
      },
      {
        "id": "H",
        "text": "Additional option H for question 5 - This option focuses on long-term strategic thinking and planning."
      }
    ]
  },
  {
    "id": 6,
    "text": "It's a peak lunch hour, and one of your fryers has suddenly broken down, limiting the number of fried dishes you can prepare. Customers are already waiting for their meals, and the front-of-house staff is receiving complaints about delays. How do you handle this situation to keep operations running smoothly?",
    "orderNumber": 6,
    "category": "Resilience and Adaptability",
    "options": [
      {
        "id": "A",
        "text": "Step away from the kitchen briefly to call maintenance and arrange for an urgent repair, asking the team to manage with the limited fryer capacity until then."
      },
      {
        "id": "B",
        "text": "Gather the team for a quick meeting to brainstorm ideas and see if they can figure out how to adjust the menu without the fryer."
      },
      {
        "id": "C",
        "text": "Assign a team member to handle all frying using the one working fryer while directing others to focus on non-fried dishes and ensuring customer communication is clear."
      },
      {
        "id": "D",
        "text": "Take the lead by focusing only on fried dishes, attempting to complete as many orders as possible yourself, and instruct the rest of the team to maintain their usual tasks."
      },
      {
        "id": "E",
        "text": "Inform the front-of-house staff to limit orders involving fried food while you work on a temporary solution with the kitchen team."
      },
      {
        "id": "F",
        "text": "Additional option F for question 6 - This option provides an alternative perspective on the situation."
      },
      {
        "id": "G",
        "text": "Additional option G for question 6 - This option represents a collaborative approach to problem-solving."
      },
      {
        "id": "H",
        "text": "Additional option H for question 6 - This option focuses on long-term strategic thinking and planning."
      }
    ]
  },
  {
    "id": 7,
    "text": "You have just implemented a new menu item that requires coordination between multiple stations. During the first few days, it becomes clear that the communication between the grill and garnish stations is not effective, leading to inconsistencies in the dish's presentation. You need to address this issue before it impacts customer satisfaction. What is your approach?",
    "orderNumber": 7,
    "category": "Team Dynamics & Collaboration",
    "options": [
      {
        "id": "A",
        "text": "Conduct a training session during a quieter time to practice coordination between the stations, ensuring everyone understands their role in preparing the new dish."
      },
      {
        "id": "B",
        "text": "Talk individually to the station leads, explaining the importance of better coordination, and ask them to come up with a solution themselves."
      },
      {
        "id": "C",
        "text": "Assign a dedicated person to manage communication between the stations, ensuring there are no more inconsistencies until the team gets used to the new process."
      },
      {
        "id": "D",
        "text": "Let the team members continue as they are for now, trusting that they will naturally improve with more practice and without intervention."
      },
      {
        "id": "E",
        "text": "Reorganize kitchen roles so that the same person is responsible for both the grill and garnish to eliminate the need for inter-station communication."
      },
      {
        "id": "F",
        "text": "Additional option F for question 7 - This option provides an alternative perspective on the situation."
      },
      {
        "id": "G",
        "text": "Additional option G for question 7 - This option represents a collaborative approach to problem-solving."
      },
      {
        "id": "H",
        "text": "Additional option H for question 7 - This option focuses on long-term strategic thinking and planning."
      }
    ]
  },
  {
    "id": 8,
    "text": "Due to a miscommunication, the kitchen has over-prepared a batch of ingredients for a dish that wasn't as popular as expected. The fresh ingredients are costly, and wasting them would negatively impact the budget. How would you resolve this situation?",
    "orderNumber": 8,
    "category": "Decision-Making & Problem-Solving",
    "options": [
      {
        "id": "A",
        "text": "Immediately speak with the front-of-house staff and encourage them to promote the dish more actively to avoid waste."
      },
      {
        "id": "B",
        "text": "Store the extra ingredients and hope that you can use them the following day without affecting their quality."
      },
      {
        "id": "C",
        "text": "Inform the team to incorporate the ingredients into specials or modify other dishes to make use of the surplus, ensuring nothing is wasted."
      },
      {
        "id": "D",
        "text": "Ask the head chef to decide how to handle the excess ingredients, as it's not your responsibility."
      },
      {
        "id": "E",
        "text": "Dispose of the ingredients that you can't use tonight, considering it a lesson in proper communication for next time."
      },
      {
        "id": "F",
        "text": "Additional option F for question 8 - This option provides an alternative perspective on the situation."
      },
      {
        "id": "G",
        "text": "Additional option G for question 8 - This option represents a collaborative approach to problem-solving."
      },
      {
        "id": "H",
        "text": "Additional option H for question 8 - This option focuses on long-term strategic thinking and planning."
      }
    ]
  },
  {
    "id": 9,
    "text": "One of your servers approaches you visibly upset after an interaction with a customer. They feel disrespected and their mood is clearly affecting their performance. The restaurant is still busy, and you need everyone focused. How do you respond?",
    "orderNumber": 9,
    "category": "Self-Awareness & Emotional Intelligence",
    "options": [
      {
        "id": "A",
        "text": "Pull the server aside and tell them to toughen up since handling difficult customers is part of the job."
      },
      {
        "id": "B",
        "text": "Ask them to take a short break to gather themselves and remind them that the team relies on their positive attitude during service."
      },
      {
        "id": "C",
        "text": "Offer your sympathy and encourage them to share their feelings while reminding them that they need to regain focus once they're back on the floor."
      },
      {
        "id": "D",
        "text": "Arrange for the server to switch tasks with someone else for a while, moving them to a less customer-facing role temporarily."
      },
      {
        "id": "E",
        "text": "Ignore their complaint for now, assuming that they will eventually get over it on their own without intervention."
      },
      {
        "id": "F",
        "text": "Additional option F for question 9 - This option provides an alternative perspective on the situation."
      },
      {
        "id": "G",
        "text": "Additional option G for question 9 - This option represents a collaborative approach to problem-solving."
      },
      {
        "id": "H",
        "text": "Additional option H for question 9 - This option focuses on long-term strategic thinking and planning."
      }
    ]
  },
  {
    "id": 10,
    "text": "A customer has returned a meal, unhappy with the quality of the dish, and they seem quite frustrated. The server who handled the situation tells you that the customer is considering leaving a negative review online. What do you do to de-escalate the situation?",
    "orderNumber": 10,
    "category": "Communication & Active Listening",
    "options": [
      {
        "id": "A",
        "text": "Apologize to the customer personally and offer to replace the meal or provide a complimentary dessert to make up for their poor experience."
      },
      {
        "id": "B",
        "text": "Ask the server to handle the situation as they see fit and remind them to reassure the customer as much as possible."
      },
      {
        "id": "C",
        "text": "Go to the customer, listen to their complaint attentively, apologize sincerely, and offer a discount on their current bill as a goodwill gesture."
      },
      {
        "id": "D",
        "text": "Inform the customer that their dissatisfaction will be taken into consideration but explain that sometimes these things happen."
      },
      {
        "id": "E",
        "text": "Offer a public apology in front of other customers to emphasize the restaurant's commitment to quality, hoping to set a positive example."
      },
      {
        "id": "F",
        "text": "Additional option F for question 10 - This option provides an alternative perspective on the situation."
      },
      {
        "id": "G",
        "text": "Additional option G for question 10 - This option represents a collaborative approach to problem-solving."
      },
      {
        "id": "H",
        "text": "Additional option H for question 10 - This option focuses on long-term strategic thinking and planning."
      }
    ]
  },
  {
    "id": 11,
    "text": "The restaurant's delivery service has suddenly been overwhelmed due to an unexpected spike in online orders during dinner service. The kitchen is struggling to keep up with both in-house dining and delivery. What actions do you take to balance the workload?",
    "orderNumber": 11,
    "category": "Resilience and Adaptability",
    "options": [
      {
        "id": "A",
        "text": "Temporarily pause accepting new delivery orders while focusing on in-house diners until the kitchen catches up."
      },
      {
        "id": "B",
        "text": "Ask the front-of-house staff to delay informing customers of wait times, hoping that the rush will subside before issues arise."
      },
      {
        "id": "C",
        "text": "Gather the team for a quick meeting, asking for volunteers who feel comfortable working faster or taking on additional tasks to manage the surge."
      },
      {
        "id": "D",
        "text": "Prioritize deliveries over in-house orders since they have strict time requirements, and ask in-house diners to be patient."
      },
      {
        "id": "E",
        "text": "Cancel the least urgent delivery orders without informing the customers, to give the kitchen more time to work through the orders."
      },
      {
        "id": "F",
        "text": "Additional option F for question 11 - This option provides an alternative perspective on the situation."
      },
      {
        "id": "G",
        "text": "Additional option G for question 11 - This option represents a collaborative approach to problem-solving."
      },
      {
        "id": "H",
        "text": "Additional option H for question 11 - This option focuses on long-term strategic thinking and planning."
      }
    ]
  },
  {
    "id": 12,
    "text": "A new hire seems to be struggling with the pace of the kitchen during a busy shift, and the other cooks are starting to become frustrated. They are openly showing their impatience, which seems to be further affecting the new hire's performance. What do you do?",
    "orderNumber": 12,
    "category": "Team Dynamics & Collaboration",
    "options": [
      {
        "id": "A",
        "text": "Encourage the team to be patient and supportive, emphasizing that everyone was new once and that their support will help the new hire improve faster."
      },
      {
        "id": "B",
        "text": "Speak directly to the new hire, asking them to keep up or consider whether they are truly fit for this kind of work."
      },
      {
        "id": "C",
        "text": "Ask the most experienced team member to mentor the new hire during quieter shifts, ensuring that they can build their skills without pressure."
      },
      {
        "id": "D",
        "text": "Switch the new hire to a simpler role during peak hours to give them time to adjust without slowing down the rest of the team."
      },
      {
        "id": "E",
        "text": "Ignore the situation, expecting the new hire to adapt to the pace on their own eventually."
      },
      {
        "id": "F",
        "text": "Additional option F for question 12 - This option provides an alternative perspective on the situation."
      },
      {
        "id": "G",
        "text": "Additional option G for question 12 - This option represents a collaborative approach to problem-solving."
      },
      {
        "id": "H",
        "text": "Additional option H for question 12 - This option focuses on long-term strategic thinking and planning."
      }
    ]
  },
  {
    "id": 13,
    "text": "Midway through service, you realize that the preparation of several dishes is behind schedule. You suspect that an error in how tasks were assigned is the root cause, but it's already too late to change things entirely. What do you do?",
    "orderNumber": 13,
    "category": "Decision-Making & Problem-Solving",
    "options": [
      {
        "id": "A",
        "text": "Reorganize task assignments immediately, even if it disrupts the flow, to make sure every dish gets prepared eventually."
      },
      {
        "id": "B",
        "text": "Communicate clearly with the front-of-house staff, explaining the delay and coordinating expectations with the guests who are waiting."
      },
      {
        "id": "C",
        "text": "Have the team work harder to make up for the lost time without changing anything and hope that they can catch up on their own."
      },
      {
        "id": "D",
        "text": "Assign one of the sous chefs to take charge of the situation and focus on getting the most delayed dishes out as soon as possible."
      },
      {
        "id": "E",
        "text": "Stop accepting any more orders until the kitchen has caught up, even if it means upsetting waiting customers."
      },
      {
        "id": "F",
        "text": "Additional option F for question 13 - This option provides an alternative perspective on the situation."
      },
      {
        "id": "G",
        "text": "Additional option G for question 13 - This option represents a collaborative approach to problem-solving."
      },
      {
        "id": "H",
        "text": "Additional option H for question 13 - This option focuses on long-term strategic thinking and planning."
      }
    ]
  },
  {
    "id": 14,
    "text": "During a particularly busy shift, you notice that one of your team members is starting to panic, making mistakes that could affect service quality. Their mistakes are slowing things down, but they are clearly overwhelmed. How do you support them?",
    "orderNumber": 14,
    "category": "Self-Awareness & Emotional Intelligence",
    "options": [
      {
        "id": "A",
        "text": "Pull them aside and ask them to step out of the kitchen for five minutes to calm down before returning to their role."
      },
      {
        "id": "B",
        "text": "Assign them a simpler task for the rest of the shift, hoping it will ease their stress without slowing down the service."
      },
      {
        "id": "C",
        "text": "Ignore the mistakes for now, expecting the team member to work through their panic independently."
      },
      {
        "id": "D",
        "text": "Publicly point out the mistakes and explain that the performance needs to improve, emphasizing that the kitchen requires focus during busy hours."
      },
      {
        "id": "E",
        "text": "Talk to the rest of the team, asking them to take over the struggling member's tasks for the time being while they focus on recovering."
      },
      {
        "id": "F",
        "text": "Additional option F for question 14 - This option provides an alternative perspective on the situation."
      },
      {
        "id": "G",
        "text": "Additional option G for question 14 - This option represents a collaborative approach to problem-solving."
      },
      {
        "id": "H",
        "text": "Additional option H for question 14 - This option focuses on long-term strategic thinking and planning."
      }
    ]
  },
  {
    "id": 15,
    "text": "The restaurant's head chef has decided to introduce a new policy that impacts how ingredients are handled, and some members of your team are unhappy, feeling that their input was overlooked. Morale is dropping, and productivity is affected. How do you manage the situation?",
    "orderNumber": 15,
    "category": "Communication & Active Listening",
    "options": [
      {
        "id": "A",
        "text": "Call a team meeting to gather feedback, acknowledging the team's concerns and finding ways to address them while maintaining the new policy."
      },
      {
        "id": "B",
        "text": "Explain the policy firmly, emphasizing that there's no room for negotiation and they need to adapt to the changes as quickly as possible."
      },
      {
        "id": "C",
        "text": "Speak individually to each team member who seems unhappy, listening to their concerns, and offering reassurance without making promises."
      },
      {
        "id": "D",
        "text": "Ignore the negative comments and tell the team to focus on their work rather than challenging the policy decisions."
      },
      {
        "id": "E",
        "text": "Suggest to the head chef that they address the team's concerns directly to help restore morale."
      },
      {
        "id": "F",
        "text": "Additional option F for question 15 - This option provides an alternative perspective on the situation."
      },
      {
        "id": "G",
        "text": "Additional option G for question 15 - This option represents a collaborative approach to problem-solving."
      },
      {
        "id": "H",
        "text": "Additional option H for question 15 - This option focuses on long-term strategic thinking and planning."
      }
    ]
  },
  {
    "id": 16,
    "text": "You've just learned that a health inspector is on the way for a surprise visit. The kitchen is in the middle of the dinner rush, and the staff is overwhelmed. You also know that there are a few minor issues that need addressing before the inspector arrives. How do you handle this situation?",
    "orderNumber": 16,
    "category": "Resilience and Adaptability",
    "options": [
      {
        "id": "A",
        "text": "Continue the dinner service as usual, hoping that the issues won't be noticed by the health inspector."
      },
      {
        "id": "B",
        "text": "Stop service briefly to address the minor issues, instructing everyone to focus on getting the kitchen ready before resuming normal activities."
      },
      {
        "id": "C",
        "text": "Assign specific team members to quickly address the health and safety issues while the rest continue their normal tasks."
      },
      {
        "id": "D",
        "text": "Delay the inspector for as long as possible while scrambling to get the kitchen in order."
      },
      {
        "id": "E",
        "text": "Communicate with the front-of-house staff to slow down new orders, giving the kitchen team time to correct the issues while maintaining operations."
      },
      {
        "id": "F",
        "text": "Additional option F for question 16 - This option provides an alternative perspective on the situation."
      },
      {
        "id": "G",
        "text": "Additional option G for question 16 - This option represents a collaborative approach to problem-solving."
      },
      {
        "id": "H",
        "text": "Additional option H for question 16 - This option focuses on long-term strategic thinking and planning."
      }
    ]
  },
  {
    "id": 17,
    "text": "One of your cooks often interrupts their colleagues while they're explaining their ideas or challenges during team meetings. You've noticed that it's starting to discourage others from contributing, and it's affecting overall team morale. What do you do?",
    "orderNumber": 17,
    "category": "Team Dynamics & Collaboration",
    "options": [
      {
        "id": "A",
        "text": "Speak to the cook privately after the meeting, explaining the importance of allowing others to speak and encouraging more respectful behavior."
      },
      {
        "id": "B",
        "text": "Ignore the interruptions, assuming the team will adapt to the cook's style over time."
      },
      {
        "id": "C",
        "text": "Directly address the behavior in front of the team, insisting that everyone must take turns speaking during meetings."
      },
      {
        "id": "D",
        "text": "Ask other team members for their feedback on how to handle the situation, then communicate the group's input to the cook privately."
      },
      {
        "id": "E",
        "text": "Arrange for another team member to lead the next meeting, setting ground rules for how the discussion will be managed."
      },
      {
        "id": "F",
        "text": "Additional option F for question 17 - This option provides an alternative perspective on the situation."
      },
      {
        "id": "G",
        "text": "Additional option G for question 17 - This option represents a collaborative approach to problem-solving."
      },
      {
        "id": "H",
        "text": "Additional option H for question 17 - This option focuses on long-term strategic thinking and planning."
      }
    ]
  },
  {
    "id": 18,
    "text": "The restaurant has run out of an ingredient that is crucial for multiple menu items. It's a busy night, and sourcing the ingredient immediately isn't an option. You need to decide how to handle the orders that require it. What do you do?",
    "orderNumber": 18,
    "category": "Decision-Making & Problem-Solving",
    "options": [
      {
        "id": "A",
        "text": "Inform the servers to stop taking orders for those dishes, and suggest alternative dishes that are still available."
      },
      {
        "id": "B",
        "text": "Instruct the kitchen team to find a substitute ingredient, even if it means compromising on the dish's intended flavor."
      },
      {
        "id": "C",
        "text": "Notify customers about the shortage after they place their orders, offering a discount on a different item as compensation."
      },
      {
        "id": "D",
        "text": "Keep the issue to yourself and let the kitchen staff do their best to fulfill orders, hoping customers won't notice the difference."
      },
      {
        "id": "E",
        "text": "Quickly create a new special with the available ingredients and instruct the servers to promote it in place of the dishes that require the missing ingredient."
      },
      {
        "id": "F",
        "text": "Additional option F for question 18 - This option provides an alternative perspective on the situation."
      },
      {
        "id": "G",
        "text": "Additional option G for question 18 - This option represents a collaborative approach to problem-solving."
      },
      {
        "id": "H",
        "text": "Additional option H for question 18 - This option focuses on long-term strategic thinking and planning."
      }
    ]
  },
  {
    "id": 19,
    "text": "You overhear a junior chef making negative comments about a new policy you introduced regarding portion sizes. Their comments are starting to influence other staff, who now also seem hesitant to adopt the new policy. How do you address this?",
    "orderNumber": 19,
    "category": "Self-Awareness & Emotional Intelligence",
    "options": [
      {
        "id": "A",
        "text": "Take the junior chef aside privately to discuss their concerns, trying to understand their point of view and clarifying the importance of the policy."
      },
      {
        "id": "B",
        "text": "Gather the entire team and directly address the resistance, explaining the policy's benefits and insisting that it must be followed."
      },
      {
        "id": "C",
        "text": "Publicly reprimand the junior chef during the shift, making it clear that undermining policy is unacceptable."
      },
      {
        "id": "D",
        "text": "Ignore the negative comments, assuming the team will eventually understand the purpose of the new policy and fall in line."
      },
      {
        "id": "E",
        "text": "Encourage the junior chef to share their ideas for alternative ways to manage portion sizes that still align with cost and quality requirements."
      },
      {
        "id": "F",
        "text": "Additional option F for question 19 - This option provides an alternative perspective on the situation."
      },
      {
        "id": "G",
        "text": "Additional option G for question 19 - This option represents a collaborative approach to problem-solving."
      },
      {
        "id": "H",
        "text": "Additional option H for question 19 - This option focuses on long-term strategic thinking and planning."
      }
    ]
  },
  {
    "id": 20,
    "text": "A regular customer who has always praised your restaurant's service leaves a complaint about their recent experience, citing inattentive staff and slow service. You have a strong relationship with this customer and want to address their concerns personally. How do you proceed?",
    "orderNumber": 20,
    "category": "Communication & Active Listening",
    "options": [
      {
        "id": "A",
        "text": "Call the customer to apologize and ask them to share more about what went wrong so you can make improvements."
      },
      {
        "id": "B",
        "text": "Send an email apology, offering a discount on their next visit as compensation for the poor service."
      },
      {
        "id": "C",
        "text": "Ask the staff involved for their version of what happened before contacting the customer, to ensure you understand both sides of the situation."
      },
      {
        "id": "D",
        "text": "Invite the customer for a complimentary meal to show your commitment to making things right without addressing the details of their complaint directly."
      },
      {
        "id": "E",
        "text": "Do nothing immediately and instead focus on training staff to ensure that future service is more attentive, hoping the customer will see improvements on their next visit."
      },
      {
        "id": "F",
        "text": "Additional option F for question 20 - This option provides an alternative perspective on the situation."
      },
      {
        "id": "G",
        "text": "Additional option G for question 20 - This option represents a collaborative approach to problem-solving."
      },
      {
        "id": "H",
        "text": "Additional option H for question 20 - This option focuses on long-term strategic thinking and planning."
      }
    ]
  }
]